-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/lobby/Raw/CRP/code/../output/analysi
> s.log
  log type:  text
 opened on:  14 Sep 2021, 10:34:59

. 
. import delimited using ../temp/lob_bills.txt, clear
(4 vars, 6,857,772 obs)

. keep if v3 == "|111|"
(6,420,822 observations deleted)

. rename v1 bill

. rename v2 gid 

. rename v3 congress

. keep bill gid congress

. duplicates drop bill gid, force

Duplicates in terms of bill gid

(929 observations deleted)

. * there are many issues (if that's indeed what they are!) per bill.
. * i will only keep one per bill for now
. save ../output/bills.dta, replace
(note: file ../output/bills.dta not found)
file ../output/bills.dta saved

. 
. import delimited using ../temp/lob_lobbying.txt, clear
(28 vars, 1,368,958 obs)

. keep if v15 == "|2009|" | v15 == "|2010|"
(1,282,313 observations deleted)

. rename v1 report_id

. rename v5 client

. keep if regexm(client, "General Motors")
(86,608 observations deleted)

. save ../output/lobbying.dta, replace
(note: file ../output/lobbying.dta not found)
file ../output/lobbying.dta saved

. 
. import delimited using ../temp/lob_issue_NoSpecficIssue.txt, clear
(7 vars, 2,647,672 obs)

. desc

Contains data
  obs:     2,647,672                          
 vars:             7                          
 size:   317,720,640                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
v1              long    %12.0g                
v2              str38   %38s                  
v3              str5    %9s                   
v4              str32   %32s                  
v5              str23   %23s                  
v6              str12   %12s                  
v7              str6    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. rename v1 gid

. rename v2 report_id

. rename v5 year

. drop if !regexm(report_id, "^\|([A-Z]*[0-9]*\-)")
(2,498,655 observations deleted)

. keep if year == "|2009|" | year == "|2010|"
(132,465 observations deleted)

. recast str39 report_id

. save ../temp/issue_nsi.dta, replace
(note: file ../temp/issue_nsi.dta not found)
file ../temp/issue_nsi.dta saved

. 
. forv i = 1/55 {
  2.     local ii `i'
  3.     if `i' < 10 {
  4.         local ii "0`i'"
  5.     }
  6.     import delimited using ../temp/issue`ii'.txt, colrange(1:2) clear
  7.     rename v1 gid
  8.     rename v2 report_id
  9.     desc
 10.     drop if !regexm(gid, "^[0-9]+$")
 11.     drop if !regexm(report_id, "^\|([A-Z]*[0-9]*\-)")
 12.     *keep if year == "|2009|" | year == "|2010|"
.     recast str39 report_id
 13.     save ../temp/issue`i'.dta, replace
 14.     merge m:1 report_id using ../output/lobbying.dta
 15.     keep if _merge == 3
 16.     drop _merge
 17.     destring gid, replace
 18.     save ../temp/master`i'.dta, replace
 19. }
(2 vars, 89,115 obs)

Contains data
  obs:        89,115                          
 vars:             2                          
 size:   235,441,830                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1062 %1062s                
report_id       str1580 %1580s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,792 observations deleted)
(38,997 observations deleted)
(note: file ../temp/issue1.dta not found)
file ../temp/issue1.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,363
        from master                     2,326  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,363 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master1.dta not found)
file ../temp/master1.dta saved
(2 vars, 88,854 obs)

Contains data
  obs:        88,854                          
 vars:             2                          
 size:   165,268,440                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str959  %959s                 
report_id       str901  %901s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,273 observations deleted)
(37,234 observations deleted)
(note: file ../temp/issue2.dta not found)
file ../temp/issue2.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,384
        from master                     2,347  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,384 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master2.dta not found)
file ../temp/master2.dta saved
(2 vars, 90,243 obs)

Contains data
  obs:        90,243                          
 vars:             2                          
 size:   170,469,027                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str617  %617s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,756 observations deleted)
(38,127 observations deleted)
(note: file ../temp/issue3.dta not found)
file ../temp/issue3.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,397
        from master                     2,360  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,397 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master3.dta not found)
file ../temp/master3.dta saved
(2 vars, 86,313 obs)

Contains data
  obs:        86,313                          
 vars:             2                          
 size:   172,453,374                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1102 %1102s                
report_id       str896  %896s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(53,996 observations deleted)
(30,545 observations deleted)
(note: file ../temp/issue4.dta not found)
file ../temp/issue4.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,809
        from master                     1,772  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(1,809 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master4.dta not found)
file ../temp/master4.dta saved
(2 vars, 87,663 obs)

Contains data
  obs:        87,663                          
 vars:             2                          
 size:   155,251,173                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1102 %1102s                
report_id       str669  %669s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,509 observations deleted)
(33,958 observations deleted)
(note: file ../temp/issue5.dta not found)
file ../temp/issue5.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,233
        from master                     2,196  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,233 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master5.dta not found)
file ../temp/master5.dta saved
(2 vars, 89,882 obs)

Contains data
  obs:        89,882                          
 vars:             2                          
 size:   291,127,798                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1749 %1749s                
report_id       str1490 %1490s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,343 observations deleted)
(38,991 observations deleted)
(note: file ../temp/issue6.dta not found)
file ../temp/issue6.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,585
        from master                     2,548  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,585 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master6.dta not found)
file ../temp/master6.dta saved
(2 vars, 91,155 obs)

Contains data
  obs:        91,155                          
 vars:             2                          
 size:   232,627,560                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1759 %1759s                
report_id       str793  %793s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,037 observations deleted)
(40,647 observations deleted)
(note: file ../temp/issue7.dta not found)
file ../temp/issue7.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,508
        from master                     2,471  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,508 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master7.dta not found)
file ../temp/master7.dta saved
(2 vars, 90,367 obs)

Contains data
  obs:        90,367                          
 vars:             2                          
 size:   234,231,264                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1244 %1244s                
report_id       str1348 %1348s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,759 observations deleted)
(39,386 observations deleted)
(note: file ../temp/issue8.dta not found)
file ../temp/issue8.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,259
        from master                     2,222  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,259 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master8.dta not found)
file ../temp/master8.dta saved
(2 vars, 89,951 obs)

Contains data
  obs:        89,951                          
 vars:             2                          
 size:   278,578,247                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1120 %1120s                
report_id       str1977 %1977s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,713 observations deleted)
(38,906 observations deleted)
(note: file ../temp/issue9.dta not found)
file ../temp/issue9.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,369
        from master                     2,332  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,369 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master9.dta not found)
file ../temp/master9.dta saved
(2 vars, 89,947 obs)

Contains data
  obs:        89,947                          
 vars:             2                          
 size:   340,089,607                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1763 %1763s                
report_id       str2018 %2018s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,691 observations deleted)
(39,437 observations deleted)
(note: file ../temp/issue10.dta not found)
file ../temp/issue10.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,856
        from master                     2,819  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,856 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master10.dta not found)
file ../temp/master10.dta saved
(2 vars, 92,591 obs)

Contains data
  obs:        92,591                          
 vars:             2                          
 size:   154,899,398                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1578 %1578s                
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(46,631 observations deleted)
(43,616 observations deleted)
(note: file ../temp/issue11.dta not found)
file ../temp/issue11.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,379
        from master                     2,343  (_merge==1)
        from using                         36  (_merge==2)

    matched                                 1  (_merge==3)
    -----------------------------------------
(2,379 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master11.dta not found)
file ../temp/master11.dta saved
(2 vars, 92,019 obs)

Contains data
  obs:        92,019                          
 vars:             2                          
 size:   348,291,915                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1932 %1932s                
report_id       str1853 %1853s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,324 observations deleted)
(47,376 observations deleted)
(note: file ../temp/issue12.dta not found)
file ../temp/issue12.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,356
        from master                     3,319  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(3,356 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master12.dta not found)
file ../temp/master12.dta saved
(2 vars, 91,419 obs)

Contains data
  obs:        91,419                          
 vars:             2                          
 size:   168,005,519                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1726 %1726s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,094 observations deleted)
(39,252 observations deleted)
(note: file ../temp/issue13.dta not found)
file ../temp/issue13.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,110
        from master                     2,073  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,110 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master13.dta not found)
file ../temp/master13.dta saved
(2 vars, 91,962 obs)

Contains data
  obs:        91,962                          
 vars:             2                          
 size:   151,737,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str845  %845s                 
report_id       str805  %805s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,513 observations deleted)
(39,851 observations deleted)
(note: file ../temp/issue14.dta not found)
file ../temp/issue14.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,635
        from master                     2,598  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,635 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master14.dta not found)
file ../temp/master14.dta saved
(2 vars, 89,047 obs)

Contains data
  obs:        89,047                          
 vars:             2                          
 size:   207,123,322                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,589 observations deleted)
(36,316 observations deleted)
(note: file ../temp/issue15.dta not found)
file ../temp/issue15.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,179
        from master                     2,142  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,179 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master15.dta not found)
file ../temp/master15.dta saved
(2 vars, 91,037 obs)

Contains data
  obs:        91,037                          
 vars:             2                          
 size:   208,838,878                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1022 %1022s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,411 observations deleted)
(40,719 observations deleted)
(note: file ../temp/issue16.dta not found)
file ../temp/issue16.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,944
        from master                     2,907  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,944 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master16.dta not found)
file ../temp/master16.dta saved
(2 vars, 90,967 obs)

Contains data
  obs:        90,967                          
 vars:             2                          
 size:   211,589,242                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(45,365 observations deleted)
(43,421 observations deleted)
(note: file ../temp/issue17.dta not found)
file ../temp/issue17.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,218
        from master                     2,181  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,218 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master17.dta not found)
file ../temp/master17.dta saved
(2 vars, 93,251 obs)

Contains data
  obs:        93,251                          
 vars:             2                          
 size:   195,733,849                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1060 %1060s                
report_id       str1039 %1039s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(42,170 observations deleted)
(48,227 observations deleted)
(note: file ../temp/issue18.dta not found)
file ../temp/issue18.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,891
        from master                     2,854  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,891 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master18.dta not found)
file ../temp/master18.dta saved
(2 vars, 91,432 obs)

Contains data
  obs:        91,432                          
 vars:             2                          
 size:    18,853,384                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(44,458 observations deleted)
(44,319 observations deleted)
(note: file ../temp/issue19.dta not found)
file ../temp/issue19.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,692
        from master                     2,655  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,692 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master19.dta not found)
file ../temp/master19.dta saved
(2 vars, 88,855 obs)

Contains data
  obs:        88,855                          
 vars:             2                          
 size:   187,128,630                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1052 %1052s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,883 observations deleted)
(37,709 observations deleted)
(note: file ../temp/issue20.dta not found)
file ../temp/issue20.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,300
        from master                     2,263  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,300 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master20.dta not found)
file ../temp/master20.dta saved
(2 vars, 93,377 obs)

Contains data
  obs:        93,377                          
 vars:             2                          
 size:   221,303,490                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1169 %1169s                
report_id       str1201 %1201s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(52,708 observations deleted)
(38,425 observations deleted)
(note: file ../temp/issue21.dta not found)
file ../temp/issue21.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,281
        from master                     2,244  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,281 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master21.dta not found)
file ../temp/master21.dta saved
(2 vars, 88,728 obs)

Contains data
  obs:        88,728                          
 vars:             2                          
 size:   235,217,928                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1498 %1498s                
report_id       str1153 %1153s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,666 observations deleted)
(36,707 observations deleted)
(note: file ../temp/issue22.dta not found)
file ../temp/issue22.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,392
        from master                     2,355  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,392 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master22.dta not found)
file ../temp/master22.dta saved
(2 vars, 87,900 obs)

Contains data
  obs:        87,900                          
 vars:             2                          
 size:   157,956,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1033 %1033s                
report_id       str764  %764s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,683 observations deleted)
(35,097 observations deleted)
(note: file ../temp/issue23.dta not found)
file ../temp/issue23.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,157
        from master                     2,120  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,157 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master23.dta not found)
file ../temp/master23.dta saved
(2 vars, 94,505 obs)

Contains data
  obs:        94,505                          
 vars:             2                          
 size:   114,351,050                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str723  %723s                 
report_id       str487  %487s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(24,036 observations deleted)
(66,349 observations deleted)
(note: file ../temp/issue24.dta not found)
file ../temp/issue24.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,157
        from master                     4,120  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(4,157 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master24.dta not found)
file ../temp/master24.dta saved
(2 vars, 89,474 obs)

Contains data
  obs:        89,474                          
 vars:             2                          
 size:   193,890,158                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1189 %1189s                
report_id       str978  %978s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,972 observations deleted)
(38,148 observations deleted)
(note: file ../temp/issue25.dta not found)
file ../temp/issue25.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,391
        from master                     2,354  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,391 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master25.dta not found)
file ../temp/master25.dta saved
(2 vars, 88,800 obs)

Contains data
  obs:        88,800                          
 vars:             2                          
 size:   142,257,600                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1036 %1036s                
report_id       str566  %566s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,773 observations deleted)
(36,879 observations deleted)
(note: file ../temp/issue26.dta not found)
file ../temp/issue26.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,185
        from master                     2,148  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,185 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master26.dta not found)
file ../temp/master26.dta saved
(2 vars, 90,285 obs)

Contains data
  obs:        90,285                          
 vars:             2                          
 size:   270,764,715                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1510 %1510s                
report_id       str1489 %1489s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,293 observations deleted)
(40,510 observations deleted)
(note: file ../temp/issue27.dta not found)
file ../temp/issue27.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,519
        from master                     2,482  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,519 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master27.dta not found)
file ../temp/master27.dta saved
(2 vars, 91,282 obs)

Contains data
  obs:        91,282                          
 vars:             2                          
 size:   322,408,024                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1994 %1994s                
report_id       str1538 %1538s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,335 observations deleted)
(39,395 observations deleted)
(note: file ../temp/issue28.dta not found)
file ../temp/issue28.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,589
        from master                     2,552  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,589 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master28.dta not found)
file ../temp/master28.dta saved
(2 vars, 90,472 obs)

Contains data
  obs:        90,472                          
 vars:             2                          
 size:   291,229,368                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1681 %1681s                
report_id       str1538 %1538s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,817 observations deleted)
(38,494 observations deleted)
(note: file ../temp/issue29.dta not found)
file ../temp/issue29.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,198
        from master                     2,161  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,198 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master29.dta not found)
file ../temp/master29.dta saved
(2 vars, 90,476 obs)

Contains data
  obs:        90,476                          
 vars:             2                          
 size:   273,599,424                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1298 %1298s                
report_id       str1726 %1726s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,581 observations deleted)
(40,503 observations deleted)
(note: file ../temp/issue30.dta not found)
file ../temp/issue30.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,429
        from master                     2,392  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,429 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master30.dta not found)
file ../temp/master30.dta saved
(2 vars, 89,394 obs)

Contains data
  obs:        89,394                          
 vars:             2                          
 size:   163,680,414                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1060 %1060s                
report_id       str771  %771s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,991 observations deleted)
(38,073 observations deleted)
(note: file ../temp/issue31.dta not found)
file ../temp/issue31.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,367
        from master                     2,330  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,367 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master31.dta not found)
file ../temp/master31.dta saved
(2 vars, 89,400 obs)

Contains data
  obs:        89,400                          
 vars:             2                          
 size:   143,421,971                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1491 %1491s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,086 observations deleted)
(36,834 observations deleted)
(note: file ../temp/issue32.dta not found)
file ../temp/issue32.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,517
        from master                     2,480  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,517 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master32.dta not found)
file ../temp/master32.dta saved
(2 vars, 90,777 obs)

Contains data
  obs:        90,777                          
 vars:             2                          
 size:   212,145,849                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1298 %1298s                
report_id       str1039 %1039s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,108 observations deleted)
(40,227 observations deleted)
(note: file ../temp/issue33.dta not found)
file ../temp/issue33.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,479
        from master                     2,442  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,479 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master33.dta not found)
file ../temp/master33.dta saved
(2 vars, 91,900 obs)

Contains data
  obs:        91,900                          
 vars:             2                          
 size:   275,424,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str969  %969s                 
report_id       str2028 %2028s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(45,204 observations deleted)
(43,852 observations deleted)
(note: file ../temp/issue34.dta not found)
file ../temp/issue34.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,879
        from master                     2,843  (_merge==1)
        from using                         36  (_merge==2)

    matched                                 1  (_merge==3)
    -----------------------------------------
(2,879 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master34.dta not found)
file ../temp/master34.dta saved
(2 vars, 92,871 obs)

Contains data
  obs:        92,871                          
 vars:             2                          
 size:   198,093,843                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1265 %1265s                
report_id       str868  %868s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,872 observations deleted)
(48,150 observations deleted)
(note: file ../temp/issue35.dta not found)
file ../temp/issue35.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,886
        from master                     2,849  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,886 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master35.dta not found)
file ../temp/master35.dta saved
(2 vars, 90,972 obs)

Contains data
  obs:        90,972                          
 vars:             2                          
 size:   294,658,308                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1749 %1749s                
report_id       str1490 %1490s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,395 observations deleted)
(39,149 observations deleted)
(note: file ../temp/issue36.dta not found)
file ../temp/issue36.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,465
        from master                     2,428  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,465 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master36.dta not found)
file ../temp/master36.dta saved
(2 vars, 91,263 obs)

Contains data
  obs:        91,263                          
 vars:             2                          
 size:    81,179,806                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str778  %778s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,233 observations deleted)
(40,785 observations deleted)
(note: file ../temp/issue37.dta not found)
file ../temp/issue37.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,282
        from master                     2,245  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,282 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master37.dta not found)
file ../temp/master37.dta saved
(2 vars, 90,035 obs)

Contains data
  obs:        90,035                          
 vars:             2                          
 size:   179,799,895                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str966  %966s                 
report_id       str1031 %1031s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,836 observations deleted)
(38,912 observations deleted)
(note: file ../temp/issue38.dta not found)
file ../temp/issue38.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,324
        from master                     2,287  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,324 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master38.dta not found)
file ../temp/master38.dta saved
(2 vars, 91,613 obs)

Contains data
  obs:        91,613                          
 vars:             2                          
 size:   212,450,547                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1265 %1265s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(59,403 observations deleted)
(30,159 observations deleted)
(note: file ../temp/issue39.dta not found)
file ../temp/issue39.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,088
        from master                     2,051  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,088 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master39.dta not found)
file ../temp/master39.dta saved
(2 vars, 93,229 obs)

Contains data
  obs:        93,229                          
 vars:             2                          
 size:   105,612,261                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1023 %1023s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,038 observations deleted)
(42,675 observations deleted)
(note: file ../temp/issue40.dta not found)
file ../temp/issue40.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,553
        from master                     2,516  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,553 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master40.dta not found)
file ../temp/master40.dta saved
(2 vars, 94,259 obs)

Contains data
  obs:        94,259                          
 vars:             2                          
 size:    68,113,682                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str616  %616s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,967 observations deleted)
(43,632 observations deleted)
(note: file ../temp/issue41.dta not found)
file ../temp/issue41.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,697
        from master                     2,660  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,697 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master41.dta not found)
file ../temp/master41.dta saved
(2 vars, 93,658 obs)

Contains data
  obs:        93,658                          
 vars:             2                          
 size:   105,825,410                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1022 %1022s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,423 observations deleted)
(43,182 observations deleted)
(note: file ../temp/issue42.dta not found)
file ../temp/issue42.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,090
        from master                     3,053  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(3,090 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master42.dta not found)
file ../temp/master42.dta saved
(2 vars, 93,698 obs)

Contains data
  obs:        93,698                          
 vars:             2                          
 size:   223,844,522                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1351 %1351s                
report_id       str1038 %1038s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,828 observations deleted)
(49,166 observations deleted)
(note: file ../temp/issue43.dta not found)
file ../temp/issue43.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,741
        from master                     2,704  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,741 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master43.dta not found)
file ../temp/master43.dta saved
(2 vars, 96,220 obs)

Contains data
  obs:        96,220                          
 vars:             2                          
 size:   191,670,240                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1404 %1404s                
report_id       str588  %588s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(22,934 observations deleted)
(69,337 observations deleted)
(note: file ../temp/issue44.dta not found)
file ../temp/issue44.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,986
        from master                     3,949  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(3,986 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master44.dta not found)
file ../temp/master44.dta saved
(2 vars, 96,823 obs)

Contains data
  obs:        96,823                          
 vars:             2                          
 size:   368,895,630                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1991 %1991s                
report_id       str1819 %1819s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,188 observations deleted)
(73,404 observations deleted)
(note: file ../temp/issue45.dta not found)
file ../temp/issue45.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,268
        from master                     4,231  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(4,268 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master45.dta not found)
file ../temp/master45.dta saved
(2 vars, 96,393 obs)

Contains data
  obs:        96,393                          
 vars:             2                          
 size:   219,486,861                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1661 %1661s                
report_id       str616  %616s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,885 observations deleted)
(73,275 observations deleted)
(note: file ../temp/issue46.dta not found)
file ../temp/issue46.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,270
        from master                     4,233  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(4,270 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master46.dta not found)
file ../temp/master46.dta saved
(2 vars, 94,370 obs)

Contains data
  obs:        94,370                          
 vars:             2                          
 size:   180,435,440                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1324 %1324s                
report_id       str588  %588s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,575 observations deleted)
(71,713 observations deleted)
(note: file ../temp/issue47.dta not found)
file ../temp/issue47.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,119
        from master                     4,082  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(4,119 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master47.dta not found)
file ../temp/master47.dta saved
(2 vars, 96,795 obs)

Contains data
  obs:        96,795                          
 vars:             2                          
 size:   184,407,891                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1798 %1798s                
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,857 observations deleted)
(72,829 observations deleted)
(note: file ../temp/issue48.dta not found)
file ../temp/issue48.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,146
        from master                     4,109  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(4,146 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master48.dta not found)
file ../temp/master48.dta saved
(2 vars, 96,752 obs)

Contains data
  obs:        96,752                          
 vars:             2                          
 size:   292,094,288                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1983 %1983s                
report_id       str1036 %1036s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,906 observations deleted)
(73,574 observations deleted)
(note: file ../temp/issue49.dta not found)
file ../temp/issue49.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,309
        from master                     4,272  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(4,309 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master49.dta not found)
file ../temp/master49.dta saved
(2 vars, 96,646 obs)

Contains data
  obs:        96,646                          
 vars:             2                          
 size:   248,090,282                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1983 %1983s                
report_id       str584  %584s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,475 observations deleted)
(73,017 observations deleted)
(note: file ../temp/issue50.dta not found)
file ../temp/issue50.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,191
        from master                     4,154  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(4,191 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master50.dta not found)
file ../temp/master50.dta saved
(2 vars, 96,627 obs)

Contains data
  obs:        96,627                          
 vars:             2                          
 size:   170,933,163                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1263 %1263s                
report_id       str506  %506s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(20,449 observations deleted)
(72,046 observations deleted)
(note: file ../temp/issue51.dta not found)
file ../temp/issue51.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,169
        from master                     4,132  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(4,169 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master51.dta not found)
file ../temp/master51.dta saved
(2 vars, 91,483 obs)

Contains data
  obs:        91,483                          
 vars:             2                          
 size:   143,719,793                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str794  %794s                 
report_id       str777  %777s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,461 observations deleted)
(42,029 observations deleted)
(note: file ../temp/issue52.dta not found)
file ../temp/issue52.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,030
        from master                     1,993  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(2,030 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master52.dta not found)
file ../temp/master52.dta saved
(2 vars, 85,412 obs)

Contains data
  obs:        85,412                          
 vars:             2                          
 size:   154,595,720                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1104 %1104s                
report_id       str706  %706s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,103 observations deleted)
(32,657 observations deleted)
(note: file ../temp/issue53.dta not found)
file ../temp/issue53.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,689
        from master                     1,652  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(1,689 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master53.dta not found)
file ../temp/master53.dta saved
(2 vars, 88,546 obs)

Contains data
  obs:        88,546                          
 vars:             2                          
 size:   282,815,924                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str2045 %2045s                
report_id       str1149 %1149s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,468 observations deleted)
(35,455 observations deleted)
(note: file ../temp/issue54.dta not found)
file ../temp/issue54.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,660
        from master                     1,623  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(1,660 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master54.dta not found)
file ../temp/master54.dta saved
(2 vars, 8,765 obs)

Contains data
  obs:         8,765                          
 vars:             2                          
 size:     7,608,020                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str490  %490s                 
report_id       str378  %378s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(5,162 observations deleted)
(3,568 observations deleted)
(note: file ../temp/issue55.dta not found)
file ../temp/issue55.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                            72
        from master                        35  (_merge==1)
        from using                         37  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(72 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master55.dta not found)
file ../temp/master55.dta saved

. 
. clear

. forv i = 1/55 {
  2.     append using ../temp/master`i'.dta
  3. }

. append using ../temp/issue_nsi.dta

. 
. duplicates drop gid, force

Duplicates in terms of gid

(2 observations deleted)

. merge 1:m gid using ../output/bills.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                       422,396
        from master                    10,015  (_merge==1)
        from using                    412,381  (_merge==2)

    matched                            23,640  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(422,396 observations deleted)

. drop _merge

. save ../output/master.dta, replace
(note: file ../output/master.dta not found)
file ../output/master.dta saved

. 
. log close
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/lobby/Raw/CRP/code/../output/analysi
> s.log
  log type:  text
 closed on:  14 Sep 2021, 10:37:14
-------------------------------------------------------------------------------
