-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/lobby/Raw/CRP/code/../output/analysi
> s.log
  log type:  text
 opened on:  15 Sep 2021, 11:43:13

. 
. import delimited using ../temp/lob_bills.txt, clear
(4 vars, 6,857,772 obs)

. keep if v3 == "|111|"
(6,420,822 observations deleted)

. rename v1 bill

. rename v2 gid 

. rename v3 congress

. keep bill gid congress

. duplicates drop bill gid, force

Duplicates in terms of bill gid

(929 observations deleted)

. desc

Contains data
  obs:       436,021                          
 vars:             3                          
 size:    10,028,483                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
bill            str14   %14s                  
gid             long    %12.0g                
congress        str5    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. * there are many issues (if that's indeed what they are!) per bill.
. * i will only keep one per bill for now
. save ../output/bills.dta, replace
(note: file ../output/bills.dta not found)
file ../output/bills.dta saved

. 
. import delimited using ../temp/lob_lobbying.txt, clear
(28 vars, 1,368,958 obs)

. keep if v15 == "|2009|" | v15 == "|2010|"
(1,282,313 observations deleted)

. rename v15 year

. rename v13 use 

. rename v14 ind

. keep if use == "|y|" 
(12,527 observations deleted)

. rename v1 report_id

. rename v5 client

. save ../output/lobbying.dta, replace
(note: file ../output/lobbying.dta not found)
file ../output/lobbying.dta saved

. 
. import delimited using ../temp/lob_issue_NoSpecficIssue.txt, clear
(7 vars, 2,647,672 obs)

. desc

Contains data
  obs:     2,647,672                          
 vars:             7                          
 size:   317,720,640                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
v1              long    %12.0g                
v2              str38   %38s                  
v3              str5    %9s                   
v4              str32   %32s                  
v5              str23   %23s                  
v6              str12   %12s                  
v7              str6    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. rename v1 gid

. rename v2 report_id

. drop if !regexm(report_id, "^\|([A-Z]*[0-9]*\-)")
(2,498,655 observations deleted)

. *keep if year == "|2009|" | year == "|2010|"
. recast str39 report_id

. merge m:1 report_id using ../output/lobbying.dta
(note: variable v3 was str5, now str220 to accommodate using data's values)
(note: variable v4 was str32, now str69 to accommodate using data's values)
(note: variable v6 was str12, now str196 to accommodate using data's values)
(note: variable v7 was str6, now str147 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       210,279
        from master                   140,224  (_merge==1)
        from using                     70,055  (_merge==2)

    matched                             8,793  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(210,279 observations deleted)

. drop _merge

. save ../temp/master_nsi.dta, replace
(note: file ../temp/master_nsi.dta not found)
file ../temp/master_nsi.dta saved

. 
. forv i = 1/55 {
  2.     local ii `i'
  3.     if `i' < 10 {
  4.         local ii "0`i'"
  5.     }
  6.     import delimited using ../temp/issue`ii'.txt, colrange(1:2) clear
  7.     rename v1 gid
  8.     rename v2 report_id
  9.     desc
 10.     drop if !regexm(gid, "^[0-9]+$")
 11.     *drop if !regexm(report_id, "^\|([A-Z]*[0-9]*\-)")
.     *keep if year == "|2009|" | year == "|2010|"
.     recast str39 report_id, force
 12.     save ../temp/issue`i'.dta, replace
 13.     merge m:1 report_id using ../output/lobbying.dta
 14.     keep if _merge == 3
 15.     drop _merge
 16.     destring gid, replace
 17.     save ../temp/master`i'.dta, replace
 18. }
(2 vars, 89,115 obs)

Contains data
  obs:        89,115                          
 vars:             2                          
 size:   235,441,830                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1062 %1062s                
report_id       str1580 %1580s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,792 observations deleted)
(note: file ../temp/issue1.dta not found)
file ../temp/issue1.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       115,441
        from master                    41,323  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(115,441 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master1.dta not found)
file ../temp/master1.dta saved
(2 vars, 88,854 obs)

Contains data
  obs:        88,854                          
 vars:             2                          
 size:   165,268,440                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str959  %959s                 
report_id       str901  %901s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,273 observations deleted)
(note: file ../temp/issue2.dta not found)
file ../temp/issue2.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       113,699
        from master                    39,581  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(113,699 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master2.dta not found)
file ../temp/master2.dta saved
(2 vars, 90,243 obs)

Contains data
  obs:        90,243                          
 vars:             2                          
 size:   170,469,027                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str617  %617s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,756 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue3.dta not found)
file ../temp/issue3.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       113,442
        from master                    39,740  (_merge==1)
        from using                     73,702  (_merge==2)

    matched                               747  (_merge==3)
    -----------------------------------------
(113,442 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master3.dta not found)
file ../temp/master3.dta saved
(2 vars, 86,313 obs)

Contains data
  obs:        86,313                          
 vars:             2                          
 size:   172,453,374                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1102 %1102s                
report_id       str896  %896s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(53,996 observations deleted)
(note: file ../temp/issue4.dta not found)
file ../temp/issue4.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       106,435
        from master                    32,317  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(106,435 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master4.dta not found)
file ../temp/master4.dta saved
(2 vars, 87,663 obs)

Contains data
  obs:        87,663                          
 vars:             2                          
 size:   155,251,173                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1102 %1102s                
report_id       str669  %669s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,509 observations deleted)
(note: file ../temp/issue5.dta not found)
file ../temp/issue5.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       110,272
        from master                    36,154  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(110,272 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master5.dta not found)
file ../temp/master5.dta saved
(2 vars, 89,882 obs)

Contains data
  obs:        89,882                          
 vars:             2                          
 size:   291,127,798                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1749 %1749s                
report_id       str1490 %1490s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,343 observations deleted)
(note: file ../temp/issue6.dta not found)
file ../temp/issue6.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       115,493
        from master                    41,429  (_merge==1)
        from using                     74,064  (_merge==2)

    matched                               110  (_merge==3)
    -----------------------------------------
(115,493 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master6.dta not found)
file ../temp/master6.dta saved
(2 vars, 91,155 obs)

Contains data
  obs:        91,155                          
 vars:             2                          
 size:   232,627,560                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1759 %1759s                
report_id       str793  %793s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,037 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue7.dta not found)
file ../temp/issue7.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       117,114
        from master                    43,037  (_merge==1)
        from using                     74,077  (_merge==2)

    matched                                81  (_merge==3)
    -----------------------------------------
(117,114 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master7.dta not found)
file ../temp/master7.dta saved
(2 vars, 90,367 obs)

Contains data
  obs:        90,367                          
 vars:             2                          
 size:   234,231,264                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1244 %1244s                
report_id       str1348 %1348s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,759 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue8.dta not found)
file ../temp/issue8.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       115,711
        from master                    41,599  (_merge==1)
        from using                     74,112  (_merge==2)

    matched                                 9  (_merge==3)
    -----------------------------------------
(115,711 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master8.dta not found)
file ../temp/master8.dta saved
(2 vars, 89,951 obs)

Contains data
  obs:        89,951                          
 vars:             2                          
 size:   278,578,247                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1120 %1120s                
report_id       str1977 %1977s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,713 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue9.dta not found)
file ../temp/issue9.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       115,070
        from master                    41,036  (_merge==1)
        from using                     74,034  (_merge==2)

    matched                               202  (_merge==3)
    -----------------------------------------
(115,070 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master9.dta not found)
file ../temp/master9.dta saved
(2 vars, 89,947 obs)

Contains data
  obs:        89,947                          
 vars:             2                          
 size:   340,089,607                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1763 %1763s                
report_id       str2018 %2018s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,691 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue10.dta not found)
file ../temp/issue10.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       109,151
        from master                    37,356  (_merge==1)
        from using                     71,795  (_merge==2)

    matched                             4,900  (_merge==3)
    -----------------------------------------
(109,151 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master10.dta not found)
file ../temp/master10.dta saved
(2 vars, 92,591 obs)

Contains data
  obs:        92,591                          
 vars:             2                          
 size:   154,899,398                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1578 %1578s                
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(46,631 observations deleted)
report_id:  6 values changed
(note: file ../temp/issue11.dta not found)
file ../temp/issue11.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        94,971
        from master                    28,809  (_merge==1)
        from using                     66,162  (_merge==2)

    matched                            17,151  (_merge==3)
    -----------------------------------------
(94,971 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master11.dta not found)
file ../temp/master11.dta saved
(2 vars, 92,019 obs)

Contains data
  obs:        92,019                          
 vars:             2                          
 size:   348,291,915                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1932 %1932s                
report_id       str1853 %1853s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,324 observations deleted)
report_id:  7 values changed
(note: file ../temp/issue12.dta not found)
file ../temp/issue12.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       114,075
        from master                    43,345  (_merge==1)
        from using                     70,730  (_merge==2)

    matched                             7,350  (_merge==3)
    -----------------------------------------
(114,075 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master12.dta not found)
file ../temp/master12.dta saved
(2 vars, 91,419 obs)

Contains data
  obs:        91,419                          
 vars:             2                          
 size:   168,005,519                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1726 %1726s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,094 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue13.dta not found)
file ../temp/issue13.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        98,377
        from master                    29,635  (_merge==1)
        from using                     68,742  (_merge==2)

    matched                            11,690  (_merge==3)
    -----------------------------------------
(98,377 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master13.dta not found)
file ../temp/master13.dta saved
(2 vars, 91,962 obs)

Contains data
  obs:        91,962                          
 vars:             2                          
 size:   151,737,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str845  %845s                 
report_id       str805  %805s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,513 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue14.dta not found)
file ../temp/issue14.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        86,058
        from master                    21,020  (_merge==1)
        from using                     65,038  (_merge==2)

    matched                            21,429  (_merge==3)
    -----------------------------------------
(86,058 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master14.dta not found)
file ../temp/master14.dta saved
(2 vars, 89,047 obs)

Contains data
  obs:        89,047                          
 vars:             2                          
 size:   207,123,322                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,589 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue15.dta not found)
file ../temp/issue15.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       109,109
        from master                    36,065  (_merge==1)
        from using                     73,044  (_merge==2)

    matched                             2,393  (_merge==3)
    -----------------------------------------
(109,109 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master15.dta not found)
file ../temp/master15.dta saved
(2 vars, 91,037 obs)

Contains data
  obs:        91,037                          
 vars:             2                          
 size:   208,838,878                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1022 %1022s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,411 observations deleted)
(note: file ../temp/issue16.dta not found)
file ../temp/issue16.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       104,828
        from master                    35,136  (_merge==1)
        from using                     69,692  (_merge==2)

    matched                             8,490  (_merge==3)
    -----------------------------------------
(104,828 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master16.dta not found)
file ../temp/master16.dta saved
(2 vars, 90,967 obs)

Contains data
  obs:        90,967                          
 vars:             2                          
 size:   211,589,242                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(45,365 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue17.dta not found)
file ../temp/issue17.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       119,717
        from master                    45,600  (_merge==1)
        from using                     74,117  (_merge==2)

    matched                                 2  (_merge==3)
    -----------------------------------------
(119,717 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master17.dta not found)
file ../temp/master17.dta saved
(2 vars, 93,251 obs)

Contains data
  obs:        93,251                          
 vars:             2                          
 size:   195,733,849                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1060 %1060s                
report_id       str1039 %1039s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(42,170 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue18.dta not found)
file ../temp/issue18.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       117,407
        from master                    45,893  (_merge==1)
        from using                     71,514  (_merge==2)

    matched                             5,188  (_merge==3)
    -----------------------------------------
(117,407 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master18.dta not found)
file ../temp/master18.dta saved
(2 vars, 91,432 obs)

Contains data
  obs:        91,432                          
 vars:             2                          
 size:    18,853,384                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(44,458 observations deleted)
report_id:  7 values changed
(note: file ../temp/issue19.dta not found)
file ../temp/issue19.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       111,047
        from master                    40,177  (_merge==1)
        from using                     70,870  (_merge==2)

    matched                             6,797  (_merge==3)
    -----------------------------------------
(111,047 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master19.dta not found)
file ../temp/master19.dta saved
(2 vars, 88,855 obs)

Contains data
  obs:        88,855                          
 vars:             2                          
 size:   187,128,630                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1052 %1052s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,883 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue20.dta not found)
file ../temp/issue20.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       111,028
        from master                    37,852  (_merge==1)
        from using                     73,176  (_merge==2)

    matched                             2,120  (_merge==3)
    -----------------------------------------
(111,028 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master20.dta not found)
file ../temp/master20.dta saved
(2 vars, 93,377 obs)

Contains data
  obs:        93,377                          
 vars:             2                          
 size:   221,303,490                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1169 %1169s                
report_id       str1201 %1201s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(52,708 observations deleted)
(note: file ../temp/issue21.dta not found)
file ../temp/issue21.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        96,448
        from master                    27,998  (_merge==1)
        from using                     68,450  (_merge==2)

    matched                            12,671  (_merge==3)
    -----------------------------------------
(96,448 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master21.dta not found)
file ../temp/master21.dta saved
(2 vars, 88,728 obs)

Contains data
  obs:        88,728                          
 vars:             2                          
 size:   235,217,928                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1498 %1498s                
report_id       str1153 %1153s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,666 observations deleted)
(note: file ../temp/issue22.dta not found)
file ../temp/issue22.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       109,437
        from master                    36,422  (_merge==1)
        from using                     73,015  (_merge==2)

    matched                             2,640  (_merge==3)
    -----------------------------------------
(109,437 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master22.dta not found)
file ../temp/master22.dta saved
(2 vars, 87,900 obs)

Contains data
  obs:        87,900                          
 vars:             2                          
 size:   157,956,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1033 %1033s                
report_id       str764  %764s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,683 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue23.dta not found)
file ../temp/issue23.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       111,335
        from master                    37,217  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(111,335 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master23.dta not found)
file ../temp/master23.dta saved
(2 vars, 94,505 obs)

Contains data
  obs:        94,505                          
 vars:             2                          
 size:   114,351,050                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str723  %723s                 
report_id       str487  %487s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(24,036 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue24.dta not found)
file ../temp/issue24.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       144,587
        from master                    70,469  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(144,587 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master24.dta not found)
file ../temp/master24.dta saved
(2 vars, 89,474 obs)

Contains data
  obs:        89,474                          
 vars:             2                          
 size:   193,890,158                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1189 %1189s                
report_id       str978  %978s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,972 observations deleted)
report_id:  7 values changed
(note: file ../temp/issue25.dta not found)
file ../temp/issue25.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       114,604
        from master                    40,494  (_merge==1)
        from using                     74,110  (_merge==2)

    matched                                 8  (_merge==3)
    -----------------------------------------
(114,604 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master25.dta not found)
file ../temp/master25.dta saved
(2 vars, 88,800 obs)

Contains data
  obs:        88,800                          
 vars:             2                          
 size:   142,257,600                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1036 %1036s                
report_id       str566  %566s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,773 observations deleted)
(note: file ../temp/issue26.dta not found)
file ../temp/issue26.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       113,143
        from master                    39,026  (_merge==1)
        from using                     74,117  (_merge==2)

    matched                                 1  (_merge==3)
    -----------------------------------------
(113,143 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master26.dta not found)
file ../temp/master26.dta saved
(2 vars, 90,285 obs)

Contains data
  obs:        90,285                          
 vars:             2                          
 size:   270,764,715                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1510 %1510s                
report_id       str1489 %1489s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,293 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue27.dta not found)
file ../temp/issue27.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       116,782
        from master                    42,755  (_merge==1)
        from using                     74,027  (_merge==2)

    matched                               237  (_merge==3)
    -----------------------------------------
(116,782 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master27.dta not found)
file ../temp/master27.dta saved
(2 vars, 91,282 obs)

Contains data
  obs:        91,282                          
 vars:             2                          
 size:   322,408,024                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1994 %1994s                
report_id       str1538 %1538s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,335 observations deleted)
report_id:  6 values changed
(note: file ../temp/issue28.dta not found)
file ../temp/issue28.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       115,613
        from master                    41,555  (_merge==1)
        from using                     74,058  (_merge==2)

    matched                               392  (_merge==3)
    -----------------------------------------
(115,613 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master28.dta not found)
file ../temp/master28.dta saved
(2 vars, 90,472 obs)

Contains data
  obs:        90,472                          
 vars:             2                          
 size:   291,229,368                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1681 %1681s                
report_id       str1538 %1538s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,817 observations deleted)
report_id:  6 values changed
(note: file ../temp/issue29.dta not found)
file ../temp/issue29.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       112,887
        from master                    39,403  (_merge==1)
        from using                     73,484  (_merge==2)

    matched                             1,252  (_merge==3)
    -----------------------------------------
(112,887 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master29.dta not found)
file ../temp/master29.dta saved
(2 vars, 90,476 obs)

Contains data
  obs:        90,476                          
 vars:             2                          
 size:   273,599,424                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1298 %1298s                
report_id       str1726 %1726s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,581 observations deleted)
(note: file ../temp/issue30.dta not found)
file ../temp/issue30.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       110,091
        from master                    38,287  (_merge==1)
        from using                     71,804  (_merge==2)

    matched                             4,608  (_merge==3)
    -----------------------------------------
(110,091 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master30.dta not found)
file ../temp/master30.dta saved
(2 vars, 89,394 obs)

Contains data
  obs:        89,394                          
 vars:             2                          
 size:   163,680,414                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1060 %1060s                
report_id       str771  %771s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,991 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue31.dta not found)
file ../temp/issue31.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       114,433
        from master                    40,335  (_merge==1)
        from using                     74,098  (_merge==2)

    matched                                68  (_merge==3)
    -----------------------------------------
(114,433 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master31.dta not found)
file ../temp/master31.dta saved
(2 vars, 89,400 obs)

Contains data
  obs:        89,400                          
 vars:             2                          
 size:   143,421,971                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1491 %1491s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,086 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue32.dta not found)
file ../temp/issue32.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       113,414
        from master                    39,303  (_merge==1)
        from using                     74,111  (_merge==2)

    matched                                11  (_merge==3)
    -----------------------------------------
(113,414 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master32.dta not found)
file ../temp/master32.dta saved
(2 vars, 90,777 obs)

Contains data
  obs:        90,777                          
 vars:             2                          
 size:   212,145,849                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1298 %1298s                
report_id       str1039 %1039s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,108 observations deleted)
report_id:  5 values changed
(note: file ../temp/issue33.dta not found)
file ../temp/issue33.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       116,631
        from master                    42,561  (_merge==1)
        from using                     74,070  (_merge==2)

    matched                               108  (_merge==3)
    -----------------------------------------
(116,631 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master33.dta not found)
file ../temp/master33.dta saved
(2 vars, 91,900 obs)

Contains data
  obs:        91,900                          
 vars:             2                          
 size:   275,424,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str969  %969s                 
report_id       str2028 %2028s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(45,204 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue34.dta not found)
file ../temp/issue34.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       109,537
        from master                    38,847  (_merge==1)
        from using                     70,690  (_merge==2)

    matched                             7,849  (_merge==3)
    -----------------------------------------
(109,537 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master34.dta not found)
file ../temp/master34.dta saved
(2 vars, 92,871 obs)

Contains data
  obs:        92,871                          
 vars:             2                          
 size:   198,093,843                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1265 %1265s                
report_id       str868  %868s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,872 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue35.dta not found)
file ../temp/issue35.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       113,031
        from master                    43,048  (_merge==1)
        from using                     69,983  (_merge==2)

    matched                             7,951  (_merge==3)
    -----------------------------------------
(113,031 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master35.dta not found)
file ../temp/master35.dta saved
(2 vars, 90,972 obs)

Contains data
  obs:        90,972                          
 vars:             2                          
 size:   294,658,308                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1749 %1749s                
report_id       str1490 %1490s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,395 observations deleted)
(note: file ../temp/issue36.dta not found)
file ../temp/issue36.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       115,538
        from master                    41,476  (_merge==1)
        from using                     74,062  (_merge==2)

    matched                               101  (_merge==3)
    -----------------------------------------
(115,538 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master36.dta not found)
file ../temp/master36.dta saved
(2 vars, 91,263 obs)

Contains data
  obs:        91,263                          
 vars:             2                          
 size:    81,179,806                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str778  %778s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,233 observations deleted)
(note: file ../temp/issue37.dta not found)
file ../temp/issue37.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       104,387
        from master                    34,040  (_merge==1)
        from using                     70,347  (_merge==2)

    matched                             8,990  (_merge==3)
    -----------------------------------------
(104,387 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master37.dta not found)
file ../temp/master37.dta saved
(2 vars, 90,035 obs)

Contains data
  obs:        90,035                          
 vars:             2                          
 size:   179,799,895                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str966  %966s                 
report_id       str1031 %1031s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,836 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue38.dta not found)
file ../temp/issue38.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       110,278
        from master                    37,732  (_merge==1)
        from using                     72,546  (_merge==2)

    matched                             3,467  (_merge==3)
    -----------------------------------------
(110,278 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master38.dta not found)
file ../temp/master38.dta saved
(2 vars, 91,613 obs)

Contains data
  obs:        91,613                          
 vars:             2                          
 size:   212,450,547                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1265 %1265s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(59,403 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue39.dta not found)
file ../temp/issue39.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       105,278
        from master                    31,520  (_merge==1)
        from using                     73,758  (_merge==2)

    matched                               690  (_merge==3)
    -----------------------------------------
(105,278 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master39.dta not found)
file ../temp/master39.dta saved
(2 vars, 93,229 obs)

Contains data
  obs:        93,229                          
 vars:             2                          
 size:   105,612,261                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1023 %1023s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,038 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue40.dta not found)
file ../temp/issue40.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       116,446
        from master                    43,141  (_merge==1)
        from using                     73,305  (_merge==2)

    matched                             2,050  (_merge==3)
    -----------------------------------------
(116,446 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master40.dta not found)
file ../temp/master40.dta saved
(2 vars, 94,259 obs)

Contains data
  obs:        94,259                          
 vars:             2                          
 size:    68,113,682                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str616  %616s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,967 observations deleted)
report_id:  6 values changed
(note: file ../temp/issue41.dta not found)
file ../temp/issue41.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       120,410
        from master                    46,292  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(120,410 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master41.dta not found)
file ../temp/master41.dta saved
(2 vars, 93,658 obs)

Contains data
  obs:        93,658                          
 vars:             2                          
 size:   105,825,410                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1022 %1022s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,423 observations deleted)
(note: file ../temp/issue42.dta not found)
file ../temp/issue42.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       120,353
        from master                    46,235  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(120,353 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master42.dta not found)
file ../temp/master42.dta saved
(2 vars, 93,698 obs)

Contains data
  obs:        93,698                          
 vars:             2                          
 size:   223,844,522                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1351 %1351s                
report_id       str1038 %1038s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,828 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue43.dta not found)
file ../temp/issue43.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       123,393
        from master                    49,969  (_merge==1)
        from using                     73,424  (_merge==2)

    matched                             1,901  (_merge==3)
    -----------------------------------------
(123,393 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master43.dta not found)
file ../temp/master43.dta saved
(2 vars, 96,220 obs)

Contains data
  obs:        96,220                          
 vars:             2                          
 size:   191,670,240                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1404 %1404s                
report_id       str588  %588s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(22,934 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue44.dta not found)
file ../temp/issue44.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       147,404
        from master                    73,286  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(147,404 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master44.dta not found)
file ../temp/master44.dta saved
(2 vars, 96,823 obs)

Contains data
  obs:        96,823                          
 vars:             2                          
 size:   368,895,630                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1991 %1991s                
report_id       str1819 %1819s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,188 observations deleted)
(note: file ../temp/issue45.dta not found)
file ../temp/issue45.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       151,753
        from master                    77,635  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(151,753 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master45.dta not found)
file ../temp/master45.dta saved
(2 vars, 96,393 obs)

Contains data
  obs:        96,393                          
 vars:             2                          
 size:   219,486,861                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1661 %1661s                
report_id       str616  %616s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,885 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue46.dta not found)
file ../temp/issue46.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       151,626
        from master                    77,508  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(151,626 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master46.dta not found)
file ../temp/master46.dta saved
(2 vars, 94,370 obs)

Contains data
  obs:        94,370                          
 vars:             2                          
 size:   180,435,440                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1324 %1324s                
report_id       str588  %588s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,575 observations deleted)
(note: file ../temp/issue47.dta not found)
file ../temp/issue47.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       149,913
        from master                    75,795  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(149,913 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master47.dta not found)
file ../temp/master47.dta saved
(2 vars, 96,795 obs)

Contains data
  obs:        96,795                          
 vars:             2                          
 size:   184,407,891                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1798 %1798s                
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,857 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue48.dta not found)
file ../temp/issue48.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       151,056
        from master                    76,938  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(151,056 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master48.dta not found)
file ../temp/master48.dta saved
(2 vars, 96,752 obs)

Contains data
  obs:        96,752                          
 vars:             2                          
 size:   292,094,288                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1983 %1983s                
report_id       str1036 %1036s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,906 observations deleted)
(note: file ../temp/issue49.dta not found)
file ../temp/issue49.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       151,964
        from master                    77,846  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(151,964 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master49.dta not found)
file ../temp/master49.dta saved
(2 vars, 96,646 obs)

Contains data
  obs:        96,646                          
 vars:             2                          
 size:   248,090,282                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1983 %1983s                
report_id       str584  %584s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,475 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue50.dta not found)
file ../temp/issue50.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       151,289
        from master                    77,171  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(151,289 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master50.dta not found)
file ../temp/master50.dta saved
(2 vars, 96,627 obs)

Contains data
  obs:        96,627                          
 vars:             2                          
 size:   170,933,163                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1263 %1263s                
report_id       str506  %506s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(20,449 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue51.dta not found)
file ../temp/issue51.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       150,296
        from master                    76,178  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(150,296 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master51.dta not found)
file ../temp/master51.dta saved
(2 vars, 91,483 obs)

Contains data
  obs:        91,483                          
 vars:             2                          
 size:   143,719,793                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str794  %794s                 
report_id       str777  %777s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,461 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue52.dta not found)
file ../temp/issue52.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       105,536
        from master                    35,154  (_merge==1)
        from using                     70,382  (_merge==2)

    matched                             8,868  (_merge==3)
    -----------------------------------------
(105,536 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master52.dta not found)
file ../temp/master52.dta saved
(2 vars, 85,412 obs)

Contains data
  obs:        85,412                          
 vars:             2                          
 size:   154,595,720                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1104 %1104s                
report_id       str706  %706s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,103 observations deleted)
(note: file ../temp/issue53.dta not found)
file ../temp/issue53.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       108,427
        from master                    34,309  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(108,427 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master53.dta not found)
file ../temp/master53.dta saved
(2 vars, 88,546 obs)

Contains data
  obs:        88,546                          
 vars:             2                          
 size:   282,815,924                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str2045 %2045s                
report_id       str1149 %1149s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,468 observations deleted)
(note: file ../temp/issue54.dta not found)
file ../temp/issue54.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       111,196
        from master                    37,078  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(111,196 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master54.dta not found)
file ../temp/master54.dta saved
(2 vars, 8,765 obs)

Contains data
  obs:         8,765                          
 vars:             2                          
 size:     7,608,020                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str490  %490s                 
report_id       str378  %378s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(5,162 observations deleted)
(note: file ../temp/issue55.dta not found)
file ../temp/issue55.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        77,721
        from master                     3,603  (_merge==1)
        from using                     74,118  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------
(77,721 observations deleted)
gid: all characters numeric; replaced as double
(note: dataset contains 0 observations)
(note: file ../temp/master55.dta not found)
file ../temp/master55.dta saved

. 
. clear

. forv i = 1/55 {
  2.     append using ../temp/master`i'.dta
  3. }

. append using ../temp/master_nsi.dta

. 
. desc

Contains data
  obs:       161,315                          
 vars:            30                          
 size:   337,470,980                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             double  %10.0g                
report_id       str39   %39s                  
v2              str102  %102s                 
v3              str220  %220s                 
v4              str69   %69s                  
client          str178  %178s                 
v6              str196  %196s                 
v7              str147  %147s                 
v8              str82   %82s                  
v9              str82   %82s                  
v10             str81   %81s                  
v11             str81   %81s                  
v12             str52   %52s                  
use             str77   %77s                  
ind             str52   %52s                  
year            str52   %52s                  
v16             str35   %35s                  
v17             str52   %52s                  
v18             str52   %52s                  
v19             str52   %52s                  
v20             str52   %52s                  
v21             str52   %52s                  
v22             str52   %52s                  
v23             str51   %51s                  
v24             str42   %42s                  
v25             str42   %42s                  
v26             str38   %38s                  
v27             str29   %29s                  
v28             str2    %9s                   
v5              str23   %23s                  
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. tab year

                                   year |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                 |2009| |     83,769       51.93       51.93
                                 |2010| |     77,546       48.07      100.00
----------------------------------------+-----------------------------------
                                  Total |    161,315      100.00

. * or dup drop gid, force ? 
. duplicates drop gid year, force

Duplicates in terms of gid year

(8,793 observations deleted)

. merge 1:m gid using ../output/bills.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                       276,173
        from master                    86,748  (_merge==1)
        from using                    189,425  (_merge==2)

    matched                           246,596  (_merge==3)
    -----------------------------------------

. destring v8, replace
v8: all characters numeric; replaced as long
(189425 missing values generated)

. rename v8 exp

. keep if _merge == 3
(276,173 observations deleted)

. drop _merge

. save ../output/master.dta, replace
(note: file ../output/master.dta not found)
file ../output/master.dta saved

. 
. gen x = 0

. foreach co in HONDA HYUNDAI TESLA TOYOTA NISSAN CHRYSLER VOLKSWAGEN {
  2.     replace x = 1 if regexm(co, "`co'")
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. replace x = 1 if regexm(co, "FORD MOTOR")
(0 real changes made)

. replace x = 1 if regexm(co, "GENERAL MOTORS")
(0 real changes made)

. replace x = 1 if regexm(co, "ALLIANCE OF AUTO")
(0 real changes made)

. replace x = 1 if regexm(co, "NATIONAL AUTO DEAL")
(0 real changes made)

. replace x = 1 if regexm(co, "ASSOCIATION OF INTL AUTO")
(0 real changes made)

. keep if x 
(246,596 observations deleted)

. drop x

. save ../output/cars.dta, replace
(note: dataset contains 0 observations)
(note: file ../output/cars.dta not found)
file ../output/cars.dta saved

. 
. use ../output/master.dta, clear

. collapse (sum) exp, by(client year) 

. save ../output/master_client_year.dta, replace
(note: file ../output/master_client_year.dta not found)
file ../output/master_client_year.dta saved

. 
. log close
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/lobby/Raw/CRP/code/../output/analysi
> s.log
  log type:  text
 closed on:  15 Sep 2021, 11:46:20
-------------------------------------------------------------------------------
