-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/lobby/Raw/CRP/code/../output/analysi
> s.log
  log type:  text
 opened on:  15 Sep 2021, 15:21:39

. 
. import delimited using ../temp/lob_bills.txt, clear
(4 vars, 6,857,772 obs)

. keep if v3 == "|114|" | v3 == "|115|" | v3 == "|116|"
(1,703,324 observations deleted)

. rename v1 bill

. rename v2 gid 

. rename v3 congress

. keep bill gid congress

. duplicates drop bill gid, force

Duplicates in terms of bill gid

(4,109,825 observations deleted)

. desc

Contains data
  obs:     1,044,623                          
 vars:             3                          
 size:    24,026,329                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
bill            str14   %14s                  
gid             long    %12.0g                
congress        str5    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. * there are many issues (if that's indeed what they are!) per bill.
. * i will only keep one per bill for now
. save ../output/bills.dta, replace
(note: file ../output/bills.dta not found)
file ../output/bills.dta saved

. 
. import delimited using ../temp/lob_lobbying.txt, clear
(28 vars, 1,368,958 obs)

. rename v15 year

. rename v13 use 

. rename v14 ind

. keep if use == "|y|" 
(793,162 observations deleted)

. rename v1 report_id

. rename v5 client

. duplicates drop report_id, force // it's like two observations

Duplicates in terms of report_id

(1 observation deleted)

. save ../output/lobbying.dta, replace
(note: file ../output/lobbying.dta not found)
file ../output/lobbying.dta saved

. 
. import delimited using ../temp/lob_issue_NoSpecficIssue.txt, clear
(7 vars, 2,647,672 obs)

. desc

Contains data
  obs:     2,647,672                          
 vars:             7                          
 size:   317,720,640                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
v1              long    %12.0g                
v2              str38   %38s                  
v3              str5    %9s                   
v4              str32   %32s                  
v5              str23   %23s                  
v6              str12   %12s                  
v7              str6    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. rename v1 gid

. rename v2 report_id

. drop if !regexm(report_id, "^\|([A-Z]*[0-9]*\-)")
(2,498,655 observations deleted)

. *keep if year == "|2009|" | year == "|2010|"
. recast str39 report_id

. merge m:1 report_id using ../output/lobbying.dta
(note: variable v3 was str5, now str220 to accommodate using data's values)
(note: variable v4 was str32, now str69 to accommodate using data's values)
(note: variable v6 was str12, now str196 to accommodate using data's values)
(note: variable v7 was str6, now str147 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       624,824
        from master                    79,396  (_merge==1)
        from using                    545,428  (_merge==2)

    matched                            69,621  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(624,824 observations deleted)

. drop _merge

. save ../temp/master_nsi.dta, replace
(note: file ../temp/master_nsi.dta not found)
file ../temp/master_nsi.dta saved

. 
. forv i = 1/55 {
  2.     local ii `i'
  3.     if `i' < 10 {
  4.         local ii "0`i'"
  5.     }
  6.     import delimited using ../temp/issue`ii'.txt, colrange(1:2) clear
  7.     rename v1 gid
  8.     rename v2 report_id
  9.     desc
 10.     drop if !regexm(gid, "^[0-9]+$")
 11.     *drop if !regexm(report_id, "^\|([A-Z]*[0-9]*\-)")
.     *keep if year == "|2009|" | year == "|2010|"
.     recast str39 report_id, force
 12.     save ../temp/issue`i'.dta, replace
 13.     merge m:1 report_id using ../output/lobbying.dta
 14.     keep if _merge == 3
 15.     drop _merge
 16.     destring gid, replace
 17.     save ../temp/master`i'.dta, replace
 18. }
(2 vars, 89,115 obs)

Contains data
  obs:        89,115                          
 vars:             2                          
 size:   235,441,830                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1062 %1062s                
report_id       str1580 %1580s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,792 observations deleted)
(note: file ../temp/issue1.dta not found)
file ../temp/issue1.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       592,438
        from master                    23,656  (_merge==1)
        from using                    568,782  (_merge==2)

    matched                            17,667  (_merge==3)
    -----------------------------------------
(592,438 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master1.dta not found)
file ../temp/master1.dta saved
(2 vars, 88,854 obs)

Contains data
  obs:        88,854                          
 vars:             2                          
 size:   165,268,440                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str959  %959s                 
report_id       str901  %901s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,273 observations deleted)
(note: file ../temp/issue2.dta not found)
file ../temp/issue2.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       592,194
        from master                    23,069  (_merge==1)
        from using                    569,125  (_merge==2)

    matched                            16,512  (_merge==3)
    -----------------------------------------
(592,194 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master2.dta not found)
file ../temp/master2.dta saved
(2 vars, 90,243 obs)

Contains data
  obs:        90,243                          
 vars:             2                          
 size:   170,469,027                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str617  %617s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,756 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue3.dta not found)
file ../temp/issue3.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,811
        from master                    21,651  (_merge==1)
        from using                    568,160  (_merge==2)

    matched                            18,836  (_merge==3)
    -----------------------------------------
(589,811 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master3.dta not found)
file ../temp/master3.dta saved
(2 vars, 86,313 obs)

Contains data
  obs:        86,313                          
 vars:             2                          
 size:   172,453,374                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1102 %1102s                
report_id       str896  %896s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(53,996 observations deleted)
(note: file ../temp/issue4.dta not found)
file ../temp/issue4.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       587,548
        from master                    17,351  (_merge==1)
        from using                    570,197  (_merge==2)

    matched                            14,966  (_merge==3)
    -----------------------------------------
(587,548 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master4.dta not found)
file ../temp/master4.dta saved
(2 vars, 87,663 obs)

Contains data
  obs:        87,663                          
 vars:             2                          
 size:   155,251,173                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1102 %1102s                
report_id       str669  %669s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,509 observations deleted)
(note: file ../temp/issue5.dta not found)
file ../temp/issue5.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,639
        from master                    20,408  (_merge==1)
        from using                    569,231  (_merge==2)

    matched                            15,746  (_merge==3)
    -----------------------------------------
(589,639 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master5.dta not found)
file ../temp/master5.dta saved
(2 vars, 89,882 obs)

Contains data
  obs:        89,882                          
 vars:             2                          
 size:   291,127,798                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1749 %1749s                
report_id       str1490 %1490s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,343 observations deleted)
(note: file ../temp/issue6.dta not found)
file ../temp/issue6.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,743
        from master                    22,848  (_merge==1)
        from using                    567,895  (_merge==2)

    matched                            18,691  (_merge==3)
    -----------------------------------------
(590,743 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master6.dta not found)
file ../temp/master6.dta saved
(2 vars, 91,155 obs)

Contains data
  obs:        91,155                          
 vars:             2                          
 size:   232,627,560                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1759 %1759s                
report_id       str793  %793s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,037 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue7.dta not found)
file ../temp/issue7.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       591,409
        from master                    23,736  (_merge==1)
        from using                    567,673  (_merge==2)

    matched                            19,382  (_merge==3)
    -----------------------------------------
(591,409 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master7.dta not found)
file ../temp/master7.dta saved
(2 vars, 90,367 obs)

Contains data
  obs:        90,367                          
 vars:             2                          
 size:   234,231,264                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1244 %1244s                
report_id       str1348 %1348s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,759 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue8.dta not found)
file ../temp/issue8.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,912
        from master                    22,678  (_merge==1)
        from using                    568,234  (_merge==2)

    matched                            18,930  (_merge==3)
    -----------------------------------------
(590,912 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master8.dta not found)
file ../temp/master8.dta saved
(2 vars, 89,951 obs)

Contains data
  obs:        89,951                          
 vars:             2                          
 size:   278,578,247                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1120 %1120s                
report_id       str1977 %1977s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,713 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue9.dta not found)
file ../temp/issue9.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       591,127
        from master                    22,666  (_merge==1)
        from using                    568,461  (_merge==2)

    matched                            18,572  (_merge==3)
    -----------------------------------------
(591,127 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master9.dta not found)
file ../temp/master9.dta saved
(2 vars, 89,947 obs)

Contains data
  obs:        89,947                          
 vars:             2                          
 size:   340,089,607                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1763 %1763s                
report_id       str2018 %2018s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,691 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue10.dta not found)
file ../temp/issue10.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,766
        from master                    22,442  (_merge==1)
        from using                    567,324  (_merge==2)

    matched                            19,814  (_merge==3)
    -----------------------------------------
(589,766 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master10.dta not found)
file ../temp/master10.dta saved
(2 vars, 92,591 obs)

Contains data
  obs:        92,591                          
 vars:             2                          
 size:   154,899,398                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1578 %1578s                
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(46,631 observations deleted)
report_id:  6 values changed
(note: file ../temp/issue11.dta not found)
file ../temp/issue11.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       587,706
        from master                    22,672  (_merge==1)
        from using                    565,034  (_merge==2)

    matched                            23,288  (_merge==3)
    -----------------------------------------
(587,706 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master11.dta not found)
file ../temp/master11.dta saved
(2 vars, 92,019 obs)

Contains data
  obs:        92,019                          
 vars:             2                          
 size:   348,291,915                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1932 %1932s                
report_id       str1853 %1853s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,324 observations deleted)
report_id:  7 values changed
(note: file ../temp/issue12.dta not found)
file ../temp/issue12.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       591,126
        from master                    26,185  (_merge==1)
        from using                    564,941  (_merge==2)

    matched                            24,510  (_merge==3)
    -----------------------------------------
(591,126 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master12.dta not found)
file ../temp/master12.dta saved
(2 vars, 91,419 obs)

Contains data
  obs:        91,419                          
 vars:             2                          
 size:   168,005,519                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1726 %1726s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,094 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue13.dta not found)
file ../temp/issue13.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       587,844
        from master                    20,872  (_merge==1)
        from using                    566,972  (_merge==2)

    matched                            20,453  (_merge==3)
    -----------------------------------------
(587,844 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master13.dta not found)
file ../temp/master13.dta saved
(2 vars, 91,962 obs)

Contains data
  obs:        91,962                          
 vars:             2                          
 size:   151,737,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str845  %845s                 
report_id       str805  %805s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,513 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue14.dta not found)
file ../temp/issue14.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       586,944
        from master                    20,502  (_merge==1)
        from using                    566,442  (_merge==2)

    matched                            21,947  (_merge==3)
    -----------------------------------------
(586,944 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master14.dta not found)
file ../temp/master14.dta saved
(2 vars, 89,047 obs)

Contains data
  obs:        89,047                          
 vars:             2                          
 size:   207,123,322                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,589 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue15.dta not found)
file ../temp/issue15.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       588,800
        from master                    20,242  (_merge==1)
        from using                    568,558  (_merge==2)

    matched                            18,216  (_merge==3)
    -----------------------------------------
(588,800 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master15.dta not found)
file ../temp/master15.dta saved
(2 vars, 91,037 obs)

Contains data
  obs:        91,037                          
 vars:             2                          
 size:   208,838,878                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1022 %1022s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,411 observations deleted)
(note: file ../temp/issue16.dta not found)
file ../temp/issue16.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       588,718
        from master                    22,421  (_merge==1)
        from using                    566,297  (_merge==2)

    matched                            21,205  (_merge==3)
    -----------------------------------------
(588,718 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master16.dta not found)
file ../temp/master16.dta saved
(2 vars, 90,967 obs)

Contains data
  obs:        90,967                          
 vars:             2                          
 size:   211,589,242                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1272 %1272s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(45,365 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue17.dta not found)
file ../temp/issue17.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       594,198
        from master                    26,455  (_merge==1)
        from using                    567,743  (_merge==2)

    matched                            19,147  (_merge==3)
    -----------------------------------------
(594,198 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master17.dta not found)
file ../temp/master17.dta saved
(2 vars, 93,251 obs)

Contains data
  obs:        93,251                          
 vars:             2                          
 size:   195,733,849                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1060 %1060s                
report_id       str1039 %1039s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(42,170 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue18.dta not found)
file ../temp/issue18.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       593,897
        from master                    28,446  (_merge==1)
        from using                    565,451  (_merge==2)

    matched                            22,635  (_merge==3)
    -----------------------------------------
(593,897 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master18.dta not found)
file ../temp/master18.dta saved
(2 vars, 91,432 obs)

Contains data
  obs:        91,432                          
 vars:             2                          
 size:    18,853,384                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(44,458 observations deleted)
report_id:  7 values changed
(note: file ../temp/issue19.dta not found)
file ../temp/issue19.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       591,828
        from master                    25,624  (_merge==1)
        from using                    566,204  (_merge==2)

    matched                            21,350  (_merge==3)
    -----------------------------------------
(591,828 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master19.dta not found)
file ../temp/master19.dta saved
(2 vars, 88,855 obs)

Contains data
  obs:        88,855                          
 vars:             2                          
 size:   187,128,630                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1052 %1052s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,883 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue20.dta not found)
file ../temp/issue20.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,880
        from master                    21,727  (_merge==1)
        from using                    568,153  (_merge==2)

    matched                            18,245  (_merge==3)
    -----------------------------------------
(589,880 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master20.dta not found)
file ../temp/master20.dta saved
(2 vars, 93,377 obs)

Contains data
  obs:        93,377                          
 vars:             2                          
 size:   221,303,490                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1169 %1169s                
report_id       str1201 %1201s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(52,708 observations deleted)
(note: file ../temp/issue21.dta not found)
file ../temp/issue21.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,208
        from master                    21,899  (_merge==1)
        from using                    567,309  (_merge==2)

    matched                            18,770  (_merge==3)
    -----------------------------------------
(589,208 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master21.dta not found)
file ../temp/master21.dta saved
(2 vars, 88,728 obs)

Contains data
  obs:        88,728                          
 vars:             2                          
 size:   235,217,928                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1498 %1498s                
report_id       str1153 %1153s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,666 observations deleted)
(note: file ../temp/issue22.dta not found)
file ../temp/issue22.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,207
        from master                    21,357  (_merge==1)
        from using                    568,850  (_merge==2)

    matched                            17,705  (_merge==3)
    -----------------------------------------
(590,207 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master22.dta not found)
file ../temp/master22.dta saved
(2 vars, 87,900 obs)

Contains data
  obs:        87,900                          
 vars:             2                          
 size:   157,956,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1033 %1033s                
report_id       str764  %764s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,683 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue23.dta not found)
file ../temp/issue23.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,705
        from master                    21,299  (_merge==1)
        from using                    569,406  (_merge==2)

    matched                            15,918  (_merge==3)
    -----------------------------------------
(590,705 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master23.dta not found)
file ../temp/master23.dta saved
(2 vars, 94,505 obs)

Contains data
  obs:        94,505                          
 vars:             2                          
 size:   114,351,050                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str723  %723s                 
report_id       str487  %487s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(24,036 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue24.dta not found)
file ../temp/issue24.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       602,974
        from master                    39,165  (_merge==1)
        from using                    563,809  (_merge==2)

    matched                            31,304  (_merge==3)
    -----------------------------------------
(602,974 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master24.dta not found)
file ../temp/master24.dta saved
(2 vars, 89,474 obs)

Contains data
  obs:        89,474                          
 vars:             2                          
 size:   193,890,158                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1189 %1189s                
report_id       str978  %978s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,972 observations deleted)
report_id:  7 values changed
(note: file ../temp/issue25.dta not found)
file ../temp/issue25.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,920
        from master                    22,509  (_merge==1)
        from using                    568,411  (_merge==2)

    matched                            17,993  (_merge==3)
    -----------------------------------------
(590,920 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master25.dta not found)
file ../temp/master25.dta saved
(2 vars, 88,800 obs)

Contains data
  obs:        88,800                          
 vars:             2                          
 size:   142,257,600                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1036 %1036s                
report_id       str566  %566s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,773 observations deleted)
(note: file ../temp/issue26.dta not found)
file ../temp/issue26.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,634
        from master                    21,208  (_merge==1)
        from using                    568,426  (_merge==2)

    matched                            17,819  (_merge==3)
    -----------------------------------------
(589,634 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master26.dta not found)
file ../temp/master26.dta saved
(2 vars, 90,285 obs)

Contains data
  obs:        90,285                          
 vars:             2                          
 size:   270,764,715                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1510 %1510s                
report_id       str1489 %1489s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,293 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue27.dta not found)
file ../temp/issue27.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,775
        from master                    23,423  (_merge==1)
        from using                    567,352  (_merge==2)

    matched                            19,569  (_merge==3)
    -----------------------------------------
(590,775 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master27.dta not found)
file ../temp/master27.dta saved
(2 vars, 91,282 obs)

Contains data
  obs:        91,282                          
 vars:             2                          
 size:   322,408,024                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1994 %1994s                
report_id       str1538 %1538s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,335 observations deleted)
report_id:  6 values changed
(note: file ../temp/issue28.dta not found)
file ../temp/issue28.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,280
        from master                    21,745  (_merge==1)
        from using                    567,535  (_merge==2)

    matched                            20,202  (_merge==3)
    -----------------------------------------
(589,280 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master28.dta not found)
file ../temp/master28.dta saved
(2 vars, 90,472 obs)

Contains data
  obs:        90,472                          
 vars:             2                          
 size:   291,229,368                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1681 %1681s                
report_id       str1538 %1538s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,817 observations deleted)
report_id:  6 values changed
(note: file ../temp/issue29.dta not found)
file ../temp/issue29.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,448
        from master                    21,472  (_merge==1)
        from using                    567,976  (_merge==2)

    matched                            19,183  (_merge==3)
    -----------------------------------------
(589,448 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master29.dta not found)
file ../temp/master29.dta saved
(2 vars, 90,476 obs)

Contains data
  obs:        90,476                          
 vars:             2                          
 size:   273,599,424                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1298 %1298s                
report_id       str1726 %1726s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,581 observations deleted)
(note: file ../temp/issue30.dta not found)
file ../temp/issue30.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       591,226
        from master                    23,708  (_merge==1)
        from using                    567,518  (_merge==2)

    matched                            19,187  (_merge==3)
    -----------------------------------------
(591,226 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master30.dta not found)
file ../temp/master30.dta saved
(2 vars, 89,394 obs)

Contains data
  obs:        89,394                          
 vars:             2                          
 size:   163,680,414                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1060 %1060s                
report_id       str771  %771s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,991 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue31.dta not found)
file ../temp/issue31.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,097
        from master                    21,920  (_merge==1)
        from using                    568,177  (_merge==2)

    matched                            18,483  (_merge==3)
    -----------------------------------------
(590,097 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master31.dta not found)
file ../temp/master31.dta saved
(2 vars, 89,400 obs)

Contains data
  obs:        89,400                          
 vars:             2                          
 size:   143,421,971                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1491 %1491s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(50,086 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue32.dta not found)
file ../temp/issue32.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,267
        from master                    21,514  (_merge==1)
        from using                    568,753  (_merge==2)

    matched                            17,800  (_merge==3)
    -----------------------------------------
(590,267 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master32.dta not found)
file ../temp/master32.dta saved
(2 vars, 90,777 obs)

Contains data
  obs:        90,777                          
 vars:             2                          
 size:   212,145,849                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1298 %1298s                
report_id       str1039 %1039s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,108 observations deleted)
report_id:  5 values changed
(note: file ../temp/issue33.dta not found)
file ../temp/issue33.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,589
        from master                    23,141  (_merge==1)
        from using                    567,448  (_merge==2)

    matched                            19,528  (_merge==3)
    -----------------------------------------
(590,589 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master33.dta not found)
file ../temp/master33.dta saved
(2 vars, 91,900 obs)

Contains data
  obs:        91,900                          
 vars:             2                          
 size:   275,424,300                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str969  %969s                 
report_id       str2028 %2028s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(45,204 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue34.dta not found)
file ../temp/issue34.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       591,414
        from master                    24,767  (_merge==1)
        from using                    566,647  (_merge==2)

    matched                            21,929  (_merge==3)
    -----------------------------------------
(591,414 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master34.dta not found)
file ../temp/master34.dta saved
(2 vars, 92,871 obs)

Contains data
  obs:        92,871                          
 vars:             2                          
 size:   198,093,843                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1265 %1265s                
report_id       str868  %868s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,872 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue35.dta not found)
file ../temp/issue35.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       592,217
        from master                    27,518  (_merge==1)
        from using                    564,699  (_merge==2)

    matched                            23,481  (_merge==3)
    -----------------------------------------
(592,217 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master35.dta not found)
file ../temp/master35.dta saved
(2 vars, 90,972 obs)

Contains data
  obs:        90,972                          
 vars:             2                          
 size:   294,658,308                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1749 %1749s                
report_id       str1490 %1490s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(49,395 observations deleted)
(note: file ../temp/issue36.dta not found)
file ../temp/issue36.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,551
        from master                    21,960  (_merge==1)
        from using                    567,591  (_merge==2)

    matched                            19,617  (_merge==3)
    -----------------------------------------
(589,551 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master36.dta not found)
file ../temp/master36.dta saved
(2 vars, 91,263 obs)

Contains data
  obs:        91,263                          
 vars:             2                          
 size:    81,179,806                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str778  %778s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,233 observations deleted)
(note: file ../temp/issue37.dta not found)
file ../temp/issue37.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,896
        from master                    23,429  (_merge==1)
        from using                    567,467  (_merge==2)

    matched                            19,601  (_merge==3)
    -----------------------------------------
(590,896 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master37.dta not found)
file ../temp/master37.dta saved
(2 vars, 90,035 obs)

Contains data
  obs:        90,035                          
 vars:             2                          
 size:   179,799,895                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str966  %966s                 
report_id       str1031 %1031s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,836 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue38.dta not found)
file ../temp/issue38.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,388
        from master                    22,200  (_merge==1)
        from using                    568,188  (_merge==2)

    matched                            18,999  (_merge==3)
    -----------------------------------------
(590,388 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master38.dta not found)
file ../temp/master38.dta saved
(2 vars, 91,613 obs)

Contains data
  obs:        91,613                          
 vars:             2                          
 size:   212,450,547                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1265 %1265s                
report_id       str1054 %1054s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(59,403 observations deleted)
report_id:  3 values changed
(note: file ../temp/issue39.dta not found)
file ../temp/issue39.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       586,862
        from master                    17,489  (_merge==1)
        from using                    569,373  (_merge==2)

    matched                            14,721  (_merge==3)
    -----------------------------------------
(586,862 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master39.dta not found)
file ../temp/master39.dta saved
(2 vars, 93,229 obs)

Contains data
  obs:        93,229                          
 vars:             2                          
 size:   105,612,261                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1023 %1023s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(48,038 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue40.dta not found)
file ../temp/issue40.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,389
        from master                    24,413  (_merge==1)
        from using                    565,976  (_merge==2)

    matched                            20,778  (_merge==3)
    -----------------------------------------
(590,389 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master40.dta not found)
file ../temp/master40.dta saved
(2 vars, 94,259 obs)

Contains data
  obs:        94,259                          
 vars:             2                          
 size:    68,113,682                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str616  %616s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,967 observations deleted)
report_id:  6 values changed
(note: file ../temp/issue41.dta not found)
file ../temp/issue41.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       592,675
        from master                    26,290  (_merge==1)
        from using                    566,385  (_merge==2)

    matched                            20,002  (_merge==3)
    -----------------------------------------
(592,675 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master41.dta not found)
file ../temp/master41.dta saved
(2 vars, 93,658 obs)

Contains data
  obs:        93,658                          
 vars:             2                          
 size:   105,825,410                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             strL    %9s                   
report_id       str1022 %1022s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,423 observations deleted)
(note: file ../temp/issue42.dta not found)
file ../temp/issue42.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       593,437
        from master                    26,865  (_merge==1)
        from using                    566,572  (_merge==2)

    matched                            19,370  (_merge==3)
    -----------------------------------------
(593,437 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master42.dta not found)
file ../temp/master42.dta saved
(2 vars, 93,698 obs)

Contains data
  obs:        93,698                          
 vars:             2                          
 size:   223,844,522                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1351 %1351s                
report_id       str1038 %1038s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(41,828 observations deleted)
report_id:  4 values changed
(note: file ../temp/issue43.dta not found)
file ../temp/issue43.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       587,871
        from master                    28,014  (_merge==1)
        from using                    559,857  (_merge==2)

    matched                            23,856  (_merge==3)
    -----------------------------------------
(587,871 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master43.dta not found)
file ../temp/master43.dta saved
(2 vars, 96,220 obs)

Contains data
  obs:        96,220                          
 vars:             2                          
 size:   191,670,240                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1404 %1404s                
report_id       str588  %588s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(22,934 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue44.dta not found)
file ../temp/issue44.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       578,091
        from master                    34,460  (_merge==1)
        from using                    543,631  (_merge==2)

    matched                            38,826  (_merge==3)
    -----------------------------------------
(578,091 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master44.dta not found)
file ../temp/master44.dta saved
(2 vars, 96,823 obs)

Contains data
  obs:        96,823                          
 vars:             2                          
 size:   368,895,630                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1991 %1991s                
report_id       str1819 %1819s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,188 observations deleted)
(note: file ../temp/issue45.dta not found)
file ../temp/issue45.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       578,554
        from master                    36,648  (_merge==1)
        from using                    541,906  (_merge==2)

    matched                            40,987  (_merge==3)
    -----------------------------------------
(578,554 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master45.dta not found)
file ../temp/master45.dta saved
(2 vars, 96,393 obs)

Contains data
  obs:        96,393                          
 vars:             2                          
 size:   219,486,861                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1661 %1661s                
report_id       str616  %616s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,885 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue46.dta not found)
file ../temp/issue46.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       578,142
        from master                    36,251  (_merge==1)
        from using                    541,891  (_merge==2)

    matched                            41,257  (_merge==3)
    -----------------------------------------
(578,142 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master46.dta not found)
file ../temp/master46.dta saved
(2 vars, 94,370 obs)

Contains data
  obs:        94,370                          
 vars:             2                          
 size:   180,435,440                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1324 %1324s                
report_id       str588  %588s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,575 observations deleted)
(note: file ../temp/issue47.dta not found)
file ../temp/issue47.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       578,309
        from master                    35,679  (_merge==1)
        from using                    542,630  (_merge==2)

    matched                            40,116  (_merge==3)
    -----------------------------------------
(578,309 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master47.dta not found)
file ../temp/master47.dta saved
(2 vars, 96,795 obs)

Contains data
  obs:        96,795                          
 vars:             2                          
 size:   184,407,891                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1798 %1798s                
report_id       strL    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,857 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue48.dta not found)
file ../temp/issue48.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       578,457
        from master                    36,233  (_merge==1)
        from using                    542,224  (_merge==2)

    matched                            40,705  (_merge==3)
    -----------------------------------------
(578,457 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master48.dta not found)
file ../temp/master48.dta saved
(2 vars, 96,752 obs)

Contains data
  obs:        96,752                          
 vars:             2                          
 size:   292,094,288                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1983 %1983s                
report_id       str1036 %1036s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(18,906 observations deleted)
(note: file ../temp/issue49.dta not found)
file ../temp/issue49.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       578,312
        from master                    36,501  (_merge==1)
        from using                    541,811  (_merge==2)

    matched                            41,345  (_merge==3)
    -----------------------------------------
(578,312 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master49.dta not found)
file ../temp/master49.dta saved
(2 vars, 96,646 obs)

Contains data
  obs:        96,646                          
 vars:             2                          
 size:   248,090,282                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1983 %1983s                
report_id       str584  %584s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(19,475 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue50.dta not found)
file ../temp/issue50.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       578,101
        from master                    36,175  (_merge==1)
        from using                    541,926  (_merge==2)

    matched                            40,996  (_merge==3)
    -----------------------------------------
(578,101 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master50.dta not found)
file ../temp/master50.dta saved
(2 vars, 96,627 obs)

Contains data
  obs:        96,627                          
 vars:             2                          
 size:   170,933,163                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1263 %1263s                
report_id       str506  %506s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(20,449 observations deleted)
report_id:  1 value changed
(note: file ../temp/issue51.dta not found)
file ../temp/issue51.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       579,163
        from master                    36,179  (_merge==1)
        from using                    542,984  (_merge==2)

    matched                            39,999  (_merge==3)
    -----------------------------------------
(579,163 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master51.dta not found)
file ../temp/master51.dta saved
(2 vars, 91,483 obs)

Contains data
  obs:        91,483                          
 vars:             2                          
 size:   143,719,793                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str794  %794s                 
report_id       str777  %777s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(47,461 observations deleted)
report_id:  2 values changed
(note: file ../temp/issue52.dta not found)
file ../temp/issue52.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,776
        from master                    24,079  (_merge==1)
        from using                    566,697  (_merge==2)

    matched                            19,943  (_merge==3)
    -----------------------------------------
(590,776 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master52.dta not found)
file ../temp/master52.dta saved
(2 vars, 85,412 obs)

Contains data
  obs:        85,412                          
 vars:             2                          
 size:   154,595,720                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str1104 %1104s                
report_id       str706  %706s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,103 observations deleted)
(note: file ../temp/issue53.dta not found)
file ../temp/issue53.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       590,374
        from master                    20,206  (_merge==1)
        from using                    570,168  (_merge==2)

    matched                            14,103  (_merge==3)
    -----------------------------------------
(590,374 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master53.dta not found)
file ../temp/master53.dta saved
(2 vars, 88,546 obs)

Contains data
  obs:        88,546                          
 vars:             2                          
 size:   282,815,924                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str2045 %2045s                
report_id       str1149 %1149s                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(51,468 observations deleted)
(note: file ../temp/issue54.dta not found)
file ../temp/issue54.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       589,187
        from master                    19,989  (_merge==1)
        from using                    569,198  (_merge==2)

    matched                            17,089  (_merge==3)
    -----------------------------------------
(589,187 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master54.dta not found)
file ../temp/master54.dta saved
(2 vars, 8,765 obs)

Contains data
  obs:         8,765                          
 vars:             2                          
 size:     7,608,020                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             str490  %490s                 
report_id       str378  %378s                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
(5,162 observations deleted)
(note: file ../temp/issue55.dta not found)
file ../temp/issue55.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       577,110
        from master                     1,944  (_merge==1)
        from using                    575,166  (_merge==2)

    matched                             1,659  (_merge==3)
    -----------------------------------------
(577,110 observations deleted)
gid: all characters numeric; replaced as long
(note: file ../temp/master55.dta not found)
file ../temp/master55.dta saved

. 
. clear

. forv i = 1/55 {
  2.     append using ../temp/master`i'.dta
  3. }

. append using ../temp/master_nsi.dta

. 
. desc

Contains data
  obs:     1,292,573                          
 vars:            30                          
 size: 2,698,892,424                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
gid             long    %10.0g                
report_id       str39   %39s                  
v2              str102  %102s                 
v3              str220  %220s                 
v4              str69   %69s                  
client          str178  %178s                 
v6              str196  %196s                 
v7              str147  %147s                 
v8              str82   %82s                  
v9              str82   %82s                  
v10             str81   %81s                  
v11             str81   %81s                  
v12             str52   %52s                  
use             str77   %77s                  
ind             str52   %52s                  
year            str52   %52s                  
v16             str35   %35s                  
v17             str52   %52s                  
v18             str52   %52s                  
v19             str52   %52s                  
v20             str52   %52s                  
v21             str52   %52s                  
v22             str52   %52s                  
v23             str51   %51s                  
v24             str42   %42s                  
v25             str42   %42s                  
v26             str38   %38s                  
v27             str29   %29s                  
v28             str2    %9s                   
v5              str23   %23s                  
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. tab year

                                   year |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                    | | |        675        0.05        0.05
                                 |1998| |     25,977        2.01        2.06
                                 |1999| |     28,785        2.23        4.29
                                 |2000| |     32,377        2.50        6.79
                                 |2001| |     31,291        2.42        9.21
                                 |2002| |     42,093        3.26       12.47
                                 |2003| |     38,630        2.99       15.46
                                 |2004| |     40,835        3.16       18.62
                                 |2005| |     43,854        3.39       22.01
                                 |2006| |     45,110        3.49       25.50
                                 |2007| |     41,458        3.21       28.71
                                 |2008| |     73,908        5.72       34.43
                                 |2009| |     83,769        6.48       40.91
                                 |2010| |     77,546        6.00       46.91
                                 |2011| |     71,437        5.53       52.43
                                 |2012| |     68,656        5.31       57.75
                                 |2013| |     67,903        5.25       63.00
                                 |2014| |     66,099        5.11       68.11
                                 |2015| |     66,622        5.15       73.27
                                 |2016| |     67,039        5.19       78.45
                                 |2017| |     69,190        5.35       83.81
                                 |2018| |     71,946        5.57       89.37
                                 |2019| |     46,850        3.62       93.00
                                 |2020| |     73,648        5.70       98.69
                                 |2021| |     16,875        1.31      100.00
----------------------------------------+-----------------------------------
                                  Total |  1,292,573      100.00

. * or dup drop gid, force ? 
. duplicates drop gid year, force

Duplicates in terms of gid year

(67,933 observations deleted)

. merge 1:m gid using ../output/bills.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,561,466
        from master                 1,089,376  (_merge==1)
        from using                    472,090  (_merge==2)

    matched                           572,533  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(1,561,466 observations deleted)

. drop _merge

. destring v8, replace
v8: all characters numeric; replaced as long

. rename v8 exp

. save ../output/master.dta, replace
(note: file ../output/master.dta not found)
file ../output/master.dta saved

. 
. gen x = 0

. foreach co in HONDA HYUNDAI TESLA TOYOTA NISSAN CHRYSLER VOLKSWAGEN {
  2.     replace x = 1 if regexm(client, "`co'")
  3. }
(341 real changes made)
(94 real changes made)
(113 real changes made)
(0 real changes made)
(7 real changes made)
(0 real changes made)
(0 real changes made)

. replace x = 1 if regexm(client, "FORD MOTOR")
(697 real changes made)

. replace x = 1 if regexm(client, "GENERAL MOTORS")
(65 real changes made)

. replace x = 1 if regexm(client, "ALLIANCE OF AUTO")
(1,324 real changes made)

. replace x = 1 if regexm(client, "NATIONAL AUTO DEAL")
(0 real changes made)

. replace x = 1 if regexm(client, "ASSOCIATION OF INTL AUTO")
(0 real changes made)

. keep if x 
(569,892 observations deleted)

. drop x

. save ../output/cars.dta, replace
(note: file ../output/cars.dta not found)
file ../output/cars.dta saved

. 
. collapse (sum) exp, by(client bill year)

. save ../output/master_client_bill_year.dta, replace
(note: file ../output/master_client_bill_year.dta not found)
file ../output/master_client_bill_year.dta saved

. 
. * these don't add up to CRP tabulations bc of double counting across multiple
>  issues in a bill
. collapse (sum) exp, by(client year) 

. save ../output/master_client_year.dta, replace
(note: file ../output/master_client_year.dta not found)
file ../output/master_client_year.dta saved

. 
. log close
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/lobby/Raw/CRP/code/../output/analysi
> s.log
  log type:  text
 closed on:  15 Sep 2021, 15:30:23
-------------------------------------------------------------------------------
